package com.Spring.Start.Lesson_26_COLID;

public class INFO {
    //TODO:     ******************************************
    //TODO:     *  Мета: * Розыбратися із терміном SOLID *
    //TODO:     ******************************************
    //TODO:     [S]ingle Responsibility Principle - принцип єдиної відповідальносіт. (клас повинен працювати над конкретною справою)
    //TODO:     [O]pen Closed Principle - обєкти повині бути відкриті для розширення, але закриті для змінненя.
    //TODO:     [L]iskov Substitution Principle - інтерфейси відповідають принципу єдиної відповідальносіт. (інтерфейс повинено бути тільки декілька методів )
    //TODO:     [I]nterface Segregation Principle - обєкти можуть бути замінені на наслежники неміняючи стану прогурами.
    //TODO:     [D]ependency Inversion Principle - абстракція повина обходитися без деталів. (нашка від стало може жити без стола, томущо вона самодостаточна)
    //TODO:             Dependency Inversion (DI) - процес представлення зовнішніх зависимостей програмному компоненту.
    //TODO:             Inversion of Control (IoC) - це контейнер із зависимостями
   



}
