package com.Spring.Start.Lesson_30_Server_sent_Events;

public class INFO {
    //TODO:     ******************************************************************************
    //TODO:     *  Мета: * Зробити так щоб сервер публікував пости сам із якимось інтервалом *
    //TODO:     ******************************************************************************
    //TODO:     WebSocket - протокол связі TCP-соидинения, призначений
    //TODO:              для обміну сообшениями між браузером та сервером у режимі реального часу
    //TODO:                 Використовується для створення чату.
    //TODO:     -------------------------------------------------------------------------------------
    //TODO:     Server Side events -- собития с сервером
    //TODO:     **************************
    //TODO:     Цього уроку я не зрозумів
    //TODO:     **************************


}
