package com.Spring.Start.lessons_1_Autowired;

public class INFO {
    //TODO:     Початок!!!
    //TODO:     Spring context - это некоторое окружение, в котором работает приложение на Spring Framework.
    //TODO:     Собственно, контекст создаёт и хранит экземпляры классов вашего приложения, определяет их зависимости друг с другом и автоматически их задаёт.
    //TODO:     Bean - це тойже обэкт екземпляра класса, який автоматично створюэ Spring і поміщає у spring context
    //TODO:     ---------------------------------------------------------------------------------
    //TODO:     Коли ми хочемо за Autowired інтерфейс у якого э більше однієї реалізації,
    //TODO:     Нам потрібно уточнити певну реалізацію цього інтерфейса за допомогою анотації @Qualifier
    //TODO:     @Qualifier - ця анотація підставляє конкретну реалізіцію інтерфейса




}
