package com.Spring.Start.Lesson_23_Worker_messages;

public class INFO {
    //TODO:     ******************************************************
    //TODO:     *  Мета: * Розібратися із роботою по расписанию      *
    //TODO:     ******************************************************
    //TODO:     Якщо ви хочете щоб вашы методи виконювалися по распесанию, використовуэмо Scheduled
    //TODO:     @Scheduled - анотація для роботи із сатримко роботи.
    //TODO:     Можна настрояти спамер із певним ітервалом у сикундах,хвилинах,ходинах,днях, ...
    //TODO:     FixedDelay() - робить затримку перед виконанням метода
    //TODO:     fixedRate - робить задершку з момента старту метода
    //TODO:     --------------------------------------------------------------
    //TODO:     SchedulingConfigurer - інтерфейс для створення свого Scheduled
    //TODO:     ----------------------------------------------------------------------

}
