package com.Spring.Start.Lessons_2_MVC;

public class INFO {
    //TODO:     Початок!!!
    //TODO:     Spring Framework (или коротко Spring) — универсальный фреймворк с открытым исходным кодом для Java-платформы.
    //TODO:     Spring Framework - використовується для Web технологій.
    //TODO:     ------------------------------------------------------------------------------
    //TODO:     МVC - Pattern ( Model View Controller )
    //TODO:     Model - це опис сутності із якої буде створено таблицю у базі даних
    //TODO:     Controller - це роутер url
    //TODO:     View - це (home_7.html)
    //TODO:     -------------------------------------------------------------------------------
    //TODO:     Lombok - бібліотека, яка використовується для Log-иговання
    //TODO:                 та автоматичної генерації Getter, Setter and constructor
    //TODO:     ----------------------------------------------------------------------------------
    //TODO:     @SpringBootApplicat - составана анотація яка містить у собі такі анотації як:
    //TODO:                             @SpringBootConfiguration
    //TODO:                             @EnableAutoConfiguration
    //TODO:                             @ComponentScan (із дефолтною реалізацією пошуку)
    //TODO:                             @Filter
    //TODO:                             ...
    //TODO:     ----------------------------------------------------------------------------------
    //TODO:     @Entity - ця анотація створює таблицю у базі даних
    //TODO:     @ID     - ця анотацыя говорить про те що поле э ключом
    //TODO:         @GeneratedValue - це під анотація @ID. Яка говорить якою стратегыэю буде генеруватись поле ключ.
    //TODO:         Э 4 стратегії   - AUTO -
    //TODO:                           IDENTITY - (стандартна авто-інкрементацыя)
    //TODO:                           SEQUENCE
    //TODO:                           TABLE
    //TODO:     @Getter - авто-генерація Getters
    //TODO:     @Setter - авто-генерація Setters
    //TODO:     ----------------------------------------------------------------------------------
    //TODO:     @Repository -
    //TODO:     JpaRepository  - клас який містить велику кількість стандартних реалізованих методів
    //TODO:                         шаблоних дій. Наприклад зберерегти,вийняти, знайти, видалити.
    //TODO:     CrudRepository - клас який містить велику кількість стандартних реалізованих методів
    //TODO:                         шаблоних дій. Наприклад зберерегти,вийняти, знайти, видалити.
    //TODO:     ------------------------------------------------------------------------------------------
    //TODO:     @Controller - ця анотація говорить що цей клас controller,
    //TODO:                     ціль якого бути роутером для url
    //TODO:     Model - це обэкт який маэ метод addAttribute("test",test) яким може підставляти значення в View
    //TODO:     @GetMappring("/") - анотація яка утановляє що це Get запрос по url "/"
    //TODO:     @PutMapping("/") - анотація яка утановляє що це Put запрос по url "/"
    //TODO:     @DeleteMappring("/") - анотація яка утановляє що це Delete запрос по url "/"
    //TODO:     @PostMappring("/") - анотація яка утановляє що це Post запрос по url "/"
    //TODO:     @RequestMappring("/") - анотація у якый ми указуэмо якого виду у нас запрос по url "/"
    //TODO:     @Autowaured - ця анатоція інджектит/підставляє bean із String Context
    //TODO:             Існує 3 варіанат Autowaured :  1) Через Сonstructor
    //TODO:                                            2) Через Setter
    //TODO:                                            3) Через явне представлення (через форму)
    //TODO:     -------------------------------------------------------------------------------
    //TODO:
    //TODO:



}
