package com.Spring.Start.Lesson_19_Async;

public class INFO {
    //TODO:     **************************
    //TODO:     * Мета: * Створити Async *
    //TODO:     **************************
    //TODO:     @Async - позначає що даний метод асинхронний
    //TODO:     @EnableAsync - позначаэться над методом start
    //TODO:     Sync - це коли порядок відомий і код виконюється по порядку (1-2-3-4-5)
    //TODO:     Async - це коли порядок невідомий і код виконюється не по порядку (3-1-4-2-5)
    //TODO:     CompletableFuture - клас обгортка доя роботи із Async. Async - не працює  із простими обєктами
    //TODO:     Async можна використати наприклад так. User водить запрос на сайті і цей запрос іде більше 5 сикунд
    //TODO:     для user це за довго. Тоді ми встановляємо Async і ставимо обмеження в 5 сикунд
    //TODO:     поміаємо це в try catch якщо буде видавати ошибку що більше 5 сикунд будемо редіректити його на туж сторінку де він робив запрос.
    //TODO:     Запрос не пройде, але це дасть юзеру можливість знову його зробити, а не чекати поки він виконається сервером
    //TODO:
    //TODO:




}
